<template>
  <div id="app">
      <diagnosis-chart
          :chart-data="crossAnalysisDiagram"
          :min="start_value.split(':')[0] + ':' + start_value.split(':')[1]"
          :max="end_value.split(':')[0] + ':' + end_value.split(':')[1]"
          :value-arr="valueArr"
          no-data-text="路口暂无报警"
          style="height: 300px;"
      />
  </div>
</template>
<script>
import diagnosisChart from './components/diagnosisChart.vue'

export default {
  name: 'App',
  components: {
    diagnosisChart
  },
  data() {
    return {
      // 路口报警诊断图
      crossAnalysisDiagram: [],
      // 左侧图表参数
      chartOptions: {},
      start_value: '14:00',
      end_value: '14:15',
      valueArr: ['1', '5', ['1', '5']],   // '1'-单点自适应 '2'-可变车道 '3'-溢流控制 '4'-截流控制 '5'-动态绿波 '6'-区域热点
    }
  },
  methods: {
  },
  created() {

    let data1 = {"data":{"series":[{"name":"2023-07-27","values":[{"key":"14:00:00-14:05:00","value":"0.0"},{"key":"14:05:00-14:10:00","value":"0.0"},{"key":"14:10:00-14:15:00","value":"12.0"}]},{"name":"2023-07-26","values":[{"key":"14:00:00-14:05:00","value":"-999999.0"},{"key":"14:05:00-14:10:00","value":"-999999.0"},{"key":"14:10:00-14:15:00","value":"-999999.0"}]},{"name":"2023-07-29","values":[{"key":"14:00:00-14:05:00","value":"-999999.0"},{"key":"14:05:00-14:10:00","value":"-999999.0"},{"key":"14:10:00-14:15:00","value":"-999999.0"}]},{"name":"2023-07-28","values":[{"key":"14:00:00-14:05:00","value":"-999999.0"},{"key":"14:05:00-14:10:00","value":"-999999.0"},{"key":"14:10:00-14:15:00","value":"-999999.0"}]},{"name":"2023-07-23","values":[{"key":"14:00:00-14:05:00","value":"0.0"},{"key":"14:05:00-14:10:00","value":"0.0"},{"key":"14:10:00-14:15:00","value":"0.0"}]},{"name":"2023-07-25","values":[{"key":"14:00:00-14:05:00","value":"-999999.0"},{"key":"14:05:00-14:10:00","value":"-999999.0"},{"key":"14:10:00-14:15:00","value":"-999999.0"}]},{"name":"2023-07-24","values":[{"key":"14:00:00-14:05:00","value":"0.0"},{"key":"14:05:00-14:10:00","value":"0.0"},{"key":"14:10:00-14:15:00","value":"0.0"}]},{"name":"2023-07-30","values":[{"key":"14:00:00-14:05:00","value":"-999999.0"},{"key":"14:05:00-14:10:00","value":"-999999.0"},{"key":"14:10:00-14:15:00","value":"-999999.0"}]}],"axis":[{"start_time":"14:00:00","end_time":"14:05:00"},{"start_time":"14:05:00","end_time":"14:10:00"},{"start_time":"14:10:00","end_time":"14:15:00"}]},"code":200,"msg":"OK","timestamp":1690703428684}
    let data5 = {"data":{"series":[{"name":"2023-07-27","values":[{"key":"14:00:00-14:05:00","value":"-999999.0"},{"key":"14:05:00-14:10:00","value":"-999999.0"},{"key":"14:10:00-14:15:00","value":"-999999.0"}]},{"name":"2023-07-26","values":[{"key":"14:00:00-14:05:00","value":"-999999.0"},{"key":"14:05:00-14:10:00","value":"-999999.0"},{"key":"14:10:00-14:15:00","value":"-999999.0"}]},{"name":"2023-07-29","values":[{"key":"14:00:00-14:05:00","value":"-999999.0"},{"key":"14:05:00-14:10:00","value":"-999999.0"},{"key":"14:10:00-14:15:00","value":"-999999.0"}]},{"name":"2023-07-28","values":[{"key":"14:00:00-14:05:00","value":"-999999.0"},{"key":"14:05:00-14:10:00","value":"-999999.0"},{"key":"14:10:00-14:15:00","value":"-999999.0"}]},{"name":"2023-07-23","values":[{"key":"14:00:00-14:05:00","value":"0.0"},{"key":"14:05:00-14:10:00","value":"0.0"},{"key":"14:10:00-14:15:00","value":"0.0"}]},{"name":"2023-07-25","values":[{"key":"14:00:00-14:05:00","value":"-999999.0"},{"key":"14:05:00-14:10:00","value":"-999999.0"},{"key":"14:10:00-14:15:00","value":"-999999.0"}]},{"name":"2023-07-24","values":[{"key":"14:00:00-14:05:00","value":"0.0"},{"key":"14:05:00-14:10:00","value":"0.0"},{"key":"14:10:00-14:15:00","value":"0.0"}]},{"name":"2023-07-30","values":[{"key":"14:00:00-14:05:00","value":"5.0"},{"key":"14:05:00-14:10:00","value":"0.0"},{"key":"14:10:00-14:15:00","value":"1.0"}]}],"axis":[{"start_time":"14:00:00","end_time":"14:05:00"},{"start_time":"14:05:00","end_time":"14:10:00"},{"start_time":"14:10:00","end_time":"14:15:00"}]},"code":200,"msg":"OK","timestamp":1690703428684}
    let data15 = {"data":{"series":[{"name":"2023-07-27","values":[{"key":"14:00:00-14:05:00","value":"0.0"},{"key":"14:05:00-14:10:00","value":"0.0"},{"key":"14:10:00-14:15:00","value":"0.0"}]},{"name":"2023-07-26","values":[{"key":"14:00:00-14:05:00","value":"-999999.0"},{"key":"14:05:00-14:10:00","value":"-999999.0"},{"key":"14:10:00-14:15:00","value":"-999999.0"}]},{"name":"2023-07-29","values":[{"key":"14:00:00-14:05:00","value":"-999999.0"},{"key":"14:05:00-14:10:00","value":"-999999.0"},{"key":"14:10:00-14:15:00","value":"-999999.0"}]},{"name":"2023-07-28","values":[{"key":"14:00:00-14:05:00","value":"3.0"},{"key":"14:05:00-14:10:00","value":"-999999.0"},{"key":"14:10:00-14:15:00","value":"1.0"}]},{"name":"2023-07-23","values":[{"key":"14:00:00-14:05:00","value":"0.0"},{"key":"14:05:00-14:10:00","value":"0.0"},{"key":"14:10:00-14:15:00","value":"0.0"}]},{"name":"2023-07-25","values":[{"key":"14:00:00-14:05:00","value":"-999999.0"},{"key":"14:05:00-14:10:00","value":"-999999.0"},{"key":"14:10:00-14:15:00","value":"-999999.0"}]},{"name":"2023-07-24","values":[{"key":"14:00:00-14:05:00","value":"0.0"},{"key":"14:05:00-14:10:00","value":"0.0"},{"key":"14:10:00-14:15:00","value":"0.0"}]},{"name":"2023-07-30","values":[{"key":"14:00:00-14:05:00","value":"-999999.0"},{"key":"14:05:00-14:10:00","value":"-999999.0"},{"key":"14:10:00-14:15:00","value":"-999999.0"}]}],"axis":[{"start_time":"14:00:00","end_time":"14:05:00"},{"start_time":"14:05:00","end_time":"14:10:00"},{"start_time":"14:10:00","end_time":"14:15:00"}]},"code":200,"msg":"OK","timestamp":1690703428684}

    this.crossAnalysisDiagram = [data1.data.series, data5.data.series, { '1/5' : data15.data.series}];
  }
}
</script>

<style>
#app {
  font-family: Avenir, Helvetica, Arial, sans-serif;
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  text-align: center;
  color: #2c3e50;
  margin-top: 60px;
}
</style>
<style lang="less">
  .diagnosis-chart-wrap {
      width: 800px;
      height: 310px;
      transform: translateY(-2px);
  }
</style>
